{
  "cache_key": "4ef40677444601beafd63a5b86f51a85",
  "original_length": 22794,
  "formatted_text": "# Google\n\nGoogle LLC adalah sebuah perusahaan multinasional Amerika Serikat yang berkekhususan pada jasa dan produk Internet. Produk-produk tersebut meliputi teknologi pencarian, komputasi web, perangkat lunak, dan periklanan daring. Sebagian besar labanya berasal dari AdWords.\n\nGoogle didirikan oleh **Larry Page** dan **Sergey Brin** saat masih mahasiswa Ph.D. di Universitas Stanford. Mereka berdua memegang 16 persen saham perusahaan. Mereka menjadikan Google sebagai perusahaan swasta pada tanggal 4 September 1998. Pernyataan misinya adalah \"mengumpulkan informasi dunia dan membuatnya dapat diakses dan bermanfaat oleh semua orang\", dan slogan tidak resminya adalah \"Don't be evil\". Pada tahun 2006, kantor pusat Google pindah ke Mountain View, California.\n\nSejak didirikan, pertumbuhan perusahaan yang cepat telah menghasilkan berbagai produk, akuisisi, dan kerja sama di bidang mesin pencari inti Google. Perusahaan ini menawarkan perangkat lunak produktivitas daring (dalam jaringan), termasuk surat elektronik (surel), paket aplikasi perkantoran, dan jejaring sosial. Produk-produk komputer mejanya meliputi aplikasi untuk menjelajah web, mengatur dan menyunting foto, dan pesan instan. Perusahaan ini memprakarsai pengembangan sistem operasi **Android** untuk telepon genggam dan **Google Chrome OS** untuk jajaran netbook Chromebook. Google sudah beralih ke perangkat keras komunikasi. Mereka bekerja sama dengan berbagai produsen elektronik besar untuk memproduksi perangkat Nexus-nya dan mengakuisisi **Motorola Mobility** pada Mei 2012. Tahun 2012, infrastruktur serat optik dipasang di Kansas untuk memfasilitasi layanan Internet pita lebar **Google Fiber**.\n\nPerusahaan ini diperkirakan mengoperasikan lebih dari satu juta server di beberapa pusat data di seluruh dunia dan memproses lebih dari satu miliar kueri pencarian dan sekitar 24 petabita data buatan pengguna setiap harinya.\n\nPada bulan Desember 2012, **Alexa** menyebut google.com sebagai situs web paling banyak dikunjungi di dunia. Situs-situs Google dalam bahasa lain masuk peringkat 100 teratas, sebagaimana halnya situs milik Google seperti **YouTube** dan **Blogger**. Google menempati peringkat kedua di basis data ekuitas merek BrandZ. Dominasi pasarnya menuai kritik mengenai hak cipta, penyensoran, dan privasi. Pada tahun 2014, Google juga mendapat penghargaaan dari Business Indeed sebagai perusahaan yang memiliki merk paling bernilai.\n\nPada 10 Agustus 2015, Google melalui postingan blog, CEO Google Larry Page mengumumkan pembentukan perusahan baru bernama **Alphabet** yang akan menjadi perusahaan induk mencakupi Google dan usaha-usaha lain yang tak terlalu terkait erat dengan bisnis utama Google. Pada restrukturisasi tersebut, Larry Page akan menjadi CEO perusahaan baru Alphabet. Sergey Brin menjabat sebagai President didampingi Erich Schmidt sebagai Executive Chairman. Sedangkan, CEO Google akan dijabat oleh **Sundar Pichai**.\n\n---\n\n## Produk\n\nGoogle telah membuat layanan dan peralatan untuk lingkungan bisnis dan masyarakat; termasuk aplikasi web, jaringan periklanan dan solusi bagi bisnis.\n\n### Periklanan\n\n- **Google Adsense** - Suatu jasa penawaran iklan kepada pemilik web, di mana iklan tersebut akan dapat ditampilkan pada halaman web yang relevan dengan kata kunci dari iklan tersebut.\n- **Google Adwords** - Suatu jasa pengiklanan oleh Google, di mana iklan yang tampil hanya iklan yang relevan dengan konten dari halaman web.\n\nKebanyakan dari pendapatan Google berasal dari program periklanan. Untuk keuangan tahun 2006, perusahaan ini dilaporkan mendapat jumlah keuntungan periklanan sebesar $10,492 miliar dan hanya $112 juta pada pendapatan lisensi dan lainnya.\n\nGoogle AdWords memungkinkan pengiklan web menampilkan iklannya dalam hasil pencarian Google dan Google Content Network, melalui sebuah sistem bayar perklik atau bayar perlihat. Pemilik website Google AdSense juga dapat menampilkan iklannya di situs mereka sendiri, dan mendapat untung setiap kali iklan diklik.\n\n### Aplikasi Pencarian\n\n**Google Search** - Google dikenal luas karena layanan pencarian webnya, yang mana merupakan sebuah faktor besar dari kesuksesan perusahaan ini. Pada Agustus 2007, Google merupakan mesin pencari di web yang paling sering digunakan dengan pangsa pasar sebanyak 53,6%, kemudian Yahoo! (19,9%) dan Live Search (12,9%). Google memiliki miliaran halaman web, sehingga pengguna dapat mencari informasi yang mereka inginkan, melalui penggunaan kata kunci dan operator. Google juga telah menggunakan teknologi Pencarian Web pada layanan pencarian lainnya, termasuk, Pencarian Gambar, Google News, situs perbandingan harga Google Product Search, arsip Usenet interaktif Google Groups, Google Maps dan lainnya.\n\n**Google Maps** - Layanan untuk melihat peta pada aplikasi seluler, dan juga tersedia untuk komputer personal.\n\n**Google Earth** - Layanan dari Google untuk melihat peta Bumi. Merupakan sebuah program pemetaan interaktif yang disediakan oleh satelit dan fotografi udara yang mencakup keseluru",
  "formatted_length": 5012
}